src/keda/keda-and-dapr/load-test/stream.yml
config:
  target: "http://20.49.144.228:3005"
  phases:
    - duration: 60
      arrivalRate: 100
  payload:
    path: "./customers.csv"
    skipHeader: true
    fields:
      - "id"
scenarios:
  - flow:
      - post:
          url: "/publish/deposit"
          json:
              id: "1"
              repetitions: 1
              lowamount: 1
#              delay: 5000
              busy: true
              highamount: 100
      - post:
            url: "/publish/withdraw"
            json:
              id: "1"
              repetitions: 1
              lowamount: 1
#              delay: 5000
              busy: true
              highamount: 5